tsung/critical.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="bboe.bua3k4fnrj.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="16" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="16" unit="second">
      <users arrivalrate="24" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="16" unit="second">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="16" unit="second">
      <users arrivalrate="40" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="16" unit="second">
      <users arrivalrate="48" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="16" unit="second">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <!-- Set idle connection timeout to 60 seconds -->
    <option name="idle_timeout" value="60000"/>
    <!-- Set connection timeout to 60 seconds -->
    <option name="global_ack_timeout" value="60000"/>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <!-- start out at the dashboard. -->
      <request>
        <match do="abort" when="nomatch">HTTP/1.1 200</match>
        <http url="/"/>
      </request>

      <!-- visit the new submission form, as a user would do.  -->
      <request>
        <match do="abort" when="nomatch">HTTP/1.1 200</match>
        <dyn_variable name="authenticity_token"/>
        <http url="/submissions/new"/>
      </request>

      <!-- replace + with %2b in authenticity token -->
      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
        <var name="authenticity_token" />
      </setdynvars>

      <!-- create a new submission in the community we just created -->
      <setdynvars sourcetype="random_number" start="1" end="999999999">
        <var name="random_submission_name" />
      </setdynvars>

      <request subst="true">
        <match do="abort" when="nomatch">HTTP/1.1 302</match>
        <dyn_variable name="created_submission_id" re="[Ll]ocation: http://.*/submissions/(.*)\r"/>
        <http
          contents="authenticity_token=%%_authenticity_token%%&amp;submission%5Btitle%5D=link_%%_random_submission_name%%&amp;submission%5Burl%5D=http%3A%2F%2Fwww.article.com%2F%%_random_submission_name%%&amp;submission%5Bcommunity_id%5D=1&amp;commit=Create+Submission"
          method="POST"
          url="/submissions"/>
      </request>

      <!-- visit the show show submission page as the browser would be redirected to -->
      <request subst="true">
        <match do="abort" when="nomatch">HTTP/1.1 200</match>
        <http url="/submissions/%%_created_submission_id%%"/>
      </request>
    </session>
  </sessions>
</tsung>