tsung/simple.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="6f63a6d1.ngrok.io" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="1" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set idle connection timeout to 2 seconds -->
    <option name="idle_timeout" value="2000"></option>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <request>
        <http url="/"></http>
      </request>
    </session>
  </sessions>
</tsung>